# Используем официальный образ Go как базовый для сборки
FROM golang:1.20-alpine AS builder

# Устанавливаем рабочий каталог внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для кэширования зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем исходный код приложения
COPY . .

# Собираем приложение и создаем исполняемый файл main
RUN go build -o learngo .

# Используем минимальный образ для финального контейнера
FROM alpine:latest

# Создаем рабочий каталог внутри финального контейнера
WORKDIR /app

# Копируем скомпилированный бинарный файл из предыдущего этапа
COPY --from=builder /app/learngo /app/learngo

# Указываем команду для запуска приложения
ENTRYPOINT ["/app/learngo"]

# Открываем порт, на котором будет работать приложение
EXPOSE 8090
